# Pandas： 数据库处理

In [1]:
import pandas as pd

In [42]:
## read csv, not only for csv format, also txt
df = pd.read_csv('./titanic_train.csv')

In [8]:
## read head lines, default 5 lines
df.head()
df.head(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [9]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [11]:
## the basic information of dataframe
## to find NA value
## object = strings
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [12]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [14]:
## the deafult is the first line
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [15]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [16]:
## ensure the values is array format
df.values

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

## creat a dataframe

In [17]:
## key --> value
data = {
    'A':['11','22','33'],
    'B':['1f','31','1qe']   
}

df_data = pd.DataFrame(data)
df_data

    A    B
0  11   1f
1  22   31
2  33  1qe

In [20]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
A    3 non-null object
B    3 non-null object
dtypes: object(2)
memory usage: 128.0+ bytes

In [125]:
## detail describe, exclude object(string)
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Get data from dataframe

In [47]:
age = df['Age']

age.head(5)
age[:5]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [5]:
## set index
df = df.set_index('Name')
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [51]:
age['Braund, Mr. Owen Harris']

22.0

In [59]:
df['Age']['Braund, Mr. Owen Harris']

22.0

## 索引

In [61]:
## loc, use index to localize
df.head()
df.loc['Braund, Mr. Owen Harris']

PassengerId            1
Survived               0
Pclass                 3
Sex                 male
Age                   22
SibSp                  1
Parch                  0
Ticket         A/5 21171
Fare                7.25
Cabin                NaN
Embarked               S
Name: Braund, Mr. Owen Harris, dtype: object

In [69]:
df.loc['Braund, Mr. Owen Harris','Ticket']

'A/5 21171'

In [43]:
## iloc, use position(number) to localize
df.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [45]:
## 指定行的指定列
df.iloc[2:3,5:6]

    Age
2  26.0

In [49]:
age = age + 10
print(age.max())
age.min()
age.mean()

100.0

49.69911764705882

## bool index

In [71]:
df['Fare'] > 40

Name
Braund, Mr. Owen Harris                                      False
Cumings, Mrs. John Bradley (Florence Briggs Thayer)           True
Heikkinen, Miss. Laina                                       False
Futrelle, Mrs. Jacques Heath (Lily May Peel)                  True
Allen, Mr. William Henry                                     False
Moran, Mr. James                                             False
McCarthy, Mr. Timothy J                                       True
Palsson, Master. Gosta Leonard                               False
Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)            False
Nasser, Mrs. Nicholas (Adele Achem)                          False
Sandstrom, Miss. Marguerite Rut                              False
Bonnell, Miss. Elizabeth                                     False
Saundercock, Mr. William Henry                               False
Andersson, Mr. Anders Johan                                  False
Vestrom, Miss. Hulda Amanda Adolfina                         False
Hewlett, Mrs. (Mary D Kingcome)                              False
Rice, Master. Eugene                                         False
Williams, Mr. Charles Eugene                                 False
Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)      False
Masselmani, Mrs. Fatima                                      False
Fynney, Mr. Joseph J                                         False
Beesley, Mr. Lawrence                                        False
McGowan, Miss. Anna "Annie"                                  False
Sloper, Mr. William Thompson                                 False
Palsson, Miss. Torborg Danira                                False
Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)    False
Emir, Mr. Farred Chehab                                      False
Fortune, Mr. Charles Alexander                                True
O'Dwyer, Miss. Ellen "Nellie"                                False
Todoroff, Mr. Lalio                                          False
                                                             ...
Giles, Mr. Frederick Edward                                  False
Swift, Mrs. Frederick Joel (Margaret Welles Barron)          False
Sage, Miss. Dorothy Edith "Dolly"                             True
Gill, Mr. John William                                       False
Bystrom, Mrs. (Karolina)                                     False
Duran y More, Miss. Asuncion                                 False
Roebling, Mr. Washington Augustus II                          True
van Melkebeke, Mr. Philemon                                  False
Johnson, Master. Harold Theodor                              False
Balkic, Mr. Cerin                                            False
Beckwith, Mrs. Richard Leonard (Sallie Monypeny)              True
Carlsson, Mr. Frans Olof                                     False
Vander Cruyssen, Mr. Victor                                  False
Abelson, Mrs. Samuel (Hannah Wizosky)                        False
Najib, Miss. Adele Kiamie "Jane"                             False
Gustafsson, Mr. Alfred Ossian                                False
Petroff, Mr. Nedelio                                         False
Laleff, Mr. Kristo                                           False
Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)                 True
Shelley, Mrs. William (Imanita Parrish Hall)                 False
Markun, Mr. Johann                                           False
Dahlberg, Miss. Gerda Ulrika                                 False
Banfield, Mr. Frederick James                                False
Sutehall, Mr. Henry Jr                                       False
Rice, Mrs. William (Margaret Norton)                         False
Montvila, Rev. Juozas                                        False
Graham, Miss. Margaret Edith                                 False
Johnston, Miss. Catherine Helen "Carrie"                     False
Behr, Mr. Karl Howell                                        False
Dooley, Mr. Patrick                                          False
Name: Fare, Length: 891, dtype: bool

In [72]:
df[df['Fare'] > 40][:5]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"McCarthy, Mr. Timothy J",7,0,1,male,54.0,0,0,17463,51.8625,E46,S
"Fortune, Mr. Charles Alexander",28,0,1,male,19.0,3,2,19950,263.0000,C23 C25 C27,S
"Spencer, Mrs. William Augustus (Marie Eugenie)",32,1,1,female,NaN,1,0,PC 17569,146.5208,B78,C

In [73]:
df[df['Sex'] == 'male'][:5]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
"Moran, Mr. James",6,0,3,male,NaN,0,0,330877,8.4583,NaN,Q
"McCarthy, Mr. Timothy J",7,0,1,male,54.0,0,0,17463,51.8625,E46,S
"Palsson, Master. Gosta Leonard",8,0,3,male,2.0,3,1,349909,21.0750,NaN,S

In [82]:
df[df['Sex'] == 'male']['Age'].mean()

30.72664459161148

In [83]:
df.loc[df['Sex'] == 'male','Age'].mean()

30.72664459161148

In [91]:
df[df['Age'] > 70]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Goldschmidt, Mr. George B",97,0,1,male,71.0,0,0,PC 17754,34.6542,A5,C
"Connors, Mr. Patrick",117,0,3,male,70.5,0,0,370369,7.7500,NaN,Q
"Artagaveytia, Mr. Ramon",494,0,1,male,71.0,0,0,PC 17609,49.5042,NaN,C
"Barkworth, Mr. Algernon Henry Wilson",631,1,1,male,80.0,0,0,27042,30.0000,A23,S
"Svensson, Mr. Johan",852,0,3,male,74.0,0,0,347060,7.7750,NaN,S

In [96]:
(df['Age'] > 70).sum()

5

## groupby

In [124]:
data_df = pd.DataFrame(
    {
    'Key':['AA','BB','CC','AA','DD','BB','AA','EE','AA'],
    'Value':[1,3,4,1,3,6,5,1,4]
    }
)
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
Key      9 non-null object
Value    9 non-null int64
dtypes: int64(1), object(1)
memory usage: 224.0+ bytes

In [127]:
data_df.groupby('Key').sum()

     Value
Key
AA      11
BB       9
CC       4
DD       3
EE       1

In [128]:
data_df.groupby('Key').mean()

     Value
Key
AA    2.75
BB    4.50
CC    4.00
DD    3.00
EE    1.00

In [130]:
## 安装性别，统计年龄的平均值
df.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

## 二元统计

In [132]:
df.cov()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,66231.000000,-0.626966,-7.561798,138.696504,-16.325843,-0.342697,161.883369
Survived,-0.626966,0.236772,-0.137703,-0.551296,-0.018954,0.032017,6.221787
Pclass,-7.561798,-0.137703,0.699015,-4.496004,0.076599,0.012429,-22.830196
Age,138.696504,-0.551296,-4.496004,211.019125,-4.163334,-2.344191,73.849030
SibSp,-16.325843,-0.018954,0.076599,-4.163334,1.216043,0.368739,8.748734
Parch,-0.342697,0.032017,0.012429,-2.344191,0.368739,0.649728,8.661052
Fare,161.883369,6.221787,-22.830196,73.849030,8.748734,8.661052,2469.436846

In [133]:
## -1 0 1 
df.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [8]:
## get the unique type of one series and its counts
df['Age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
28.00    25
21.00    24
25.00    23
36.00    22
29.00    20
32.00    18
27.00    18
35.00    18
26.00    18
16.00    17
31.00    17
20.00    15
33.00    15
23.00    15
34.00    15
39.00    14
17.00    13
42.00    13
40.00    13
45.00    12
38.00    11
50.00    10
2.00     10
4.00     10
47.00     9
         ..
71.00     2
59.00     2
63.00     2
0.83      2
30.50     2
70.00     2
57.00     2
0.75      2
13.00     2
10.00     2
64.00     2
40.50     2
32.50     2
45.50     2
20.50     1
24.50     1
0.67      1
14.50     1
0.92      1
74.00     1
34.50     1
80.00     1
12.00     1
36.50     1
53.00     1
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

In [12]:
df['Age'].value_counts(ascending = True)

0.42      1
23.50     1
66.00     1
70.50     1
55.50     1
53.00     1
36.50     1
12.00     1
80.00     1
34.50     1
74.00     1
0.92      1
14.50     1
0.67      1
24.50     1
20.50     1
45.50     2
32.50     2
40.50     2
64.00     2
10.00     2
13.00     2
0.75      2
57.00     2
70.00     2
30.50     2
0.83      2
63.00     2
59.00     2
71.00     2
         ..
47.00     9
4.00     10
2.00     10
50.00    10
38.00    11
45.00    12
40.00    13
42.00    13
17.00    13
39.00    14
34.00    15
23.00    15
33.00    15
20.00    15
31.00    17
16.00    17
26.00    18
35.00    18
27.00    18
32.00    18
29.00    20
36.00    22
25.00    23
21.00    24
28.00    25
30.00    25
19.00    25
18.00    26
22.00    27
24.00    30
Name: Age, Length: 88, dtype: int64

In [14]:
## grouping 
df['Age'].value_counts(ascending = True,bins = 10)

(72.042, 80.0]        2
(64.084, 72.042]      9
(56.126, 64.084]     24
(48.168, 56.126]     45
(8.378, 16.336]      46
(0.339, 8.378]       54
(40.21, 48.168]      70
(32.252, 40.21]     118
(24.294, 32.252]    169
(16.336, 24.294]    177
Name: Age, dtype: int64

## 对象操作

In [16]:
data = [10,11,12]
index = ['a','b','c']
s = pd.Series(data = data, index = index)
s

a    10
b    11
c    12
dtype: int64

In [25]:
## get data
print(s.iloc[0])
s[0]

10

10

In [26]:
print(s.loc['a'])
s['b']

10

11

In [30]:
## change value
print(s)
s1 = s.copy()
s1['a'] = 12
s1

a    10
b    11
c    12
dtype: int64

a    12
b    11
c    12
dtype: int64

In [33]:
## change all match value
s1.replace(to_replace= 12, value = 11, inplace = True)
s1

a    11
b    11
c    11
dtype: int64

In [34]:
s1.index

Index(['a', 'b', 'c'], dtype='object')

In [37]:
## add data
data = [10,11,12]
index = ['a','bb','cc']
s2 = pd.Series(data = data, index = index)
s2

a     10
bb    11
cc    12
dtype: int64

In [38]:
s3 = s2.append(s1)
s3

a     10
bb    11
cc    12
a     11
b     11
c     11
dtype: int64

In [44]:
s3['d'] = 9
s3

a     10
bb    11
cc    12
a     11
b     11
c     11
d      9
dtype: int64

In [41]:
## add a new serie/colmun
df['Age_N'] = df['Age'] * 10
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_N
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,220.0
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,380.0
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,260.0
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S,350.0
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S,350.0

In [45]:
## delete data
del s3['d']
s3

a     10
bb    11
cc    12
a     11
b     11
c     11
dtype: int64

In [46]:
## inplace = True, is necessary
s3.drop(['a'])
s3

a     10
bb    11
cc    12
a     11
b     11
c     11
dtype: int64

In [47]:
s3.drop(['a'], inplace = True)
s3

bb    11
cc    12
b     11
c     11
dtype: int64

## merge 合并
like join in R
full/inner/left/right

In [48]:
left = pd.DataFrame({'key1': ['K0', 'K1', 'K2', 'K3'],
                     'key2': ['K0', 'K1', 'K2', 'K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key1': ['K0', 'K1', 'K2', 'K3'],
                      'key2': ['K0', 'K1', 'K2', 'K4'],
                    'C': ['C0', 'C1', 'C2', 'C3'], 
                    'D': ['D0', 'D1', 'D2', 'D3']})

print (left)
print (right)

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K1   K1
2  A2  B2   K2   K2
3  A3  B3   K3   K3
    C   D key1 key2
0  C0  D0   K0   K0
1  C1  D1   K1   K1
2  C2  D2   K2   K2
3  C3  D3   K3   K4

In [49]:
pd.merge(left,right, on = ['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A1  B1   K1   K1  C1  D1
2  A2  B2   K2   K2  C2  D2

In [50]:
pd.merge(left,right, on = ['key1','key2'], how = 'outer')

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K1   K1   C1   D1
2   A2   B2   K2   K2   C2   D2
3   A3   B3   K3   K3  NaN  NaN
4  NaN  NaN   K3   K4   C3   D3

In [51]:
pd.merge(left,right, on = ['key1','key2'], how = 'left')

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K1   K1   C1   D1
2  A2  B2   K2   K2   C2   D2
3  A3  B3   K3   K3  NaN  NaN

In [52]:
pd.merge(left,right, on = ['key1','key2'], how = 'outer', indicator= True)

     A    B key1 key2    C    D      _merge
0   A0   B0   K0   K0   C0   D0        both
1   A1   B1   K1   K1   C1   D1        both
2   A2   B2   K2   K2   C2   D2        both
3   A3   B3   K3   K3  NaN  NaN   left_only
4  NaN  NaN   K3   K4   C3   D3  right_only

## 显示设置

In [57]:
## check the defalut first
pd.get_option('display.max_rows')

60

In [58]:
pd.Series(index = range(0,100))

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
10   NaN
11   NaN
12   NaN
13   NaN
14   NaN
15   NaN
16   NaN
17   NaN
18   NaN
19   NaN
20   NaN
21   NaN
22   NaN
23   NaN
24   NaN
25   NaN
26   NaN
27   NaN
28   NaN
29   NaN
      ..
70   NaN
71   NaN
72   NaN
73   NaN
74   NaN
75   NaN
76   NaN
77   NaN
78   NaN
79   NaN
80   NaN
81   NaN
82   NaN
83   NaN
84   NaN
85   NaN
86   NaN
87   NaN
88   NaN
89   NaN
90   NaN
91   NaN
92   NaN
93   NaN
94   NaN
95   NaN
96   NaN
97   NaN
98   NaN
99   NaN
Length: 100, dtype: float64

In [62]:
## then change (temportory)
pd.set_option('display.max_rows',10)

In [63]:
pd.Series(index = range(0,100))

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
      ..
95   NaN
96   NaN
97   NaN
98   NaN
99   NaN
Length: 100, dtype: float64

In [ ]:
## guid web: # http://pandas.pydata.org/pandas-docs/stable/generated/pandas.set_option.html?highlight=set_option#pandas.set_option
pd.get_option('display.max_columns')
pd.get_option('display.max_colwidth')
pd.get_option('display.precision')

## Pivot
数据透视表

In [64]:
example = pd.DataFrame({'Month': ["January", "January", "January", "January", 
                                  "February", "February", "February", "February", 
                                  "March", "March", "March", "March"],
                   'Category': ["Transportation", "Grocery", "Household", "Entertainment",
                                "Transportation", "Grocery", "Household", "Entertainment",
                                "Transportation", "Grocery", "Household", "Entertainment"],
                   'Amount': [74., 235., 175., 100., 115., 240., 225., 125., 90., 260., 200., 120.]})

In [65]:
example

    Amount        Category     Month
0     74.0  Transportation   January
1    235.0         Grocery   January
2    175.0       Household   January
3    100.0   Entertainment   January
4    115.0  Transportation  February
..     ...             ...       ...
7    125.0   Entertainment  February
8     90.0  Transportation     March
9    260.0         Grocery     March
10   200.0       Household     March
11   120.0   Entertainment     March

[12 rows x 3 columns]

In [67]:
## easy caculate, index -- y, columns --x, value -- number
gen = example.pivot(index= 'Category', columns = 'Month', values = 'Amount')
gen

Month           February  January  March
Category
Entertainment      125.0    100.0  120.0
Grocery            240.0    235.0  260.0
Household          225.0    175.0  200.0
Transportation     115.0     74.0   90.0

In [71]:
gen.sum(axis = 0)
gen.sum()

Month
February    705.0
January     584.0
March       670.0
dtype: float64

In [72]:
gen.sum(axis = 1)

Category
Entertainment     345.0
Grocery           735.0
Household         600.0
Transportation    279.0
dtype: float64

In [75]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [86]:
## the pivot can't handle when index and columns get identical paired value
## the pivot_table could solve this problem
df.pivot(index= 'Sex', columns = 'Pclass', values = 'Fare')

ValueError: Index contains duplicate entries, cannot reshape

In [88]:
df.pivot_table(index= 'Sex', columns = 'Pclass', values = 'Fare')

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [89]:
## the default function is mean
df.pivot_table(index= 'Pclass', columns = 'Sex', values = 'Fare')

Sex         female       male
Pclass
1       106.125798  67.226127
2        21.970121  19.741782
3        16.118810  12.661633

In [90]:
df.pivot_table(index= 'Sex', columns = 'Pclass', values = 'Fare',aggfunc= 'max')

Pclass         1     2      3
Sex
female  512.3292  65.0  69.55
male    512.3292  73.5  69.55

## 时间操作

In [3]:
pd.to_datetime('1992-11-4')

Timestamp('1992-11-04 00:00:00')

In [14]:
ts = pd.to_datetime('11/04/1992')
ts

Timestamp('1992-11-04 00:00:00')

In [13]:
ts.month

11

In [6]:
ts.dayofyear

309

In [18]:
ts + pd.Timedelta('5 days')

Timestamp('1992-11-09 00:00:00')

In [22]:
## 时间序列
pd.Series(pd.date_range(start = '2019/1/24', periods = 10, freq = '1D'))

0   2019-01-24
1   2019-01-25
2   2019-01-26
3   2019-01-27
4   2019-01-28
5   2019-01-29
6   2019-01-30
7   2019-01-31
8   2019-02-01
9   2019-02-02
dtype: datetime64[ns]

In [38]:
data = pd.read_csv('./flowdata-Copy1.csv')
data.head()

                  Time   L06_347  LS06_347  LS06_348
0  2009-01-01 00:00:00  0.137417  0.097500  0.016833
1  2009-01-01 03:00:00  0.131250  0.088833  0.016417
2  2009-01-01 06:00:00  0.113500  0.091250  0.016750
3  2009-01-01 09:00:00  0.135750  0.091500  0.016250
4  2009-01-01 12:00:00  0.140917  0.096167  0.017000

In [46]:
## first step for import time
data['Time'] = pd.to_datetime(data['Time'])
data = data.set_index('Time')
data.head()

                      L06_347  LS06_347  LS06_348
Time
2009-01-01 00:00:00  0.137417  0.097500  0.016833
2009-01-01 03:00:00  0.131250  0.088833  0.016417
2009-01-01 06:00:00  0.113500  0.091250  0.016750
2009-01-01 09:00:00  0.135750  0.091500  0.016250
2009-01-01 12:00:00  0.140917  0.096167  0.017000

In [58]:
## get specific value
data.loc[pd.Timestamp('2009-01-01 06:00:00')]

L06_347     0.11350
LS06_347    0.09125
LS06_348    0.01675
Name: 2009-01-01 06:00:00, dtype: float64

In [47]:
## range
data[pd.Timestamp('2009-01-01 06:00:00'):pd.Timestamp('2009-01-02 06:00:00')]

                      L06_347  LS06_347  LS06_348
Time
2009-01-01 06:00:00  0.113500  0.091250  0.016750
2009-01-01 09:00:00  0.135750  0.091500  0.016250
2009-01-01 12:00:00  0.140917  0.096167  0.017000
2009-01-01 15:00:00  0.099167  0.091667  0.017583
2009-01-01 18:00:00  0.132667  0.090167  0.016250
2009-01-01 21:00:00  0.109417  0.091167  0.016000
2009-01-02 00:00:00  0.133833  0.090417  0.016083
2009-01-02 03:00:00  0.092083  0.088667  0.016000
2009-01-02 06:00:00  0.112917  0.091417  0.016333

In [48]:
data[('2009-01-01 06:00:00'):('2009-01-02 06:00:00')]

                      L06_347  LS06_347  LS06_348
Time
2009-01-01 06:00:00  0.113500  0.091250  0.016750
2009-01-01 09:00:00  0.135750  0.091500  0.016250
2009-01-01 12:00:00  0.140917  0.096167  0.017000
2009-01-01 15:00:00  0.099167  0.091667  0.017583
2009-01-01 18:00:00  0.132667  0.090167  0.016250
2009-01-01 21:00:00  0.109417  0.091167  0.016000
2009-01-02 00:00:00  0.133833  0.090417  0.016083
2009-01-02 03:00:00  0.092083  0.088667  0.016000
2009-01-02 06:00:00  0.112917  0.091417  0.016333

In [52]:
## selected by year
data['2009'].head()

                      L06_347  LS06_347  LS06_348
Time
2009-01-01 00:00:00  0.137417  0.097500  0.016833
2009-01-01 03:00:00  0.131250  0.088833  0.016417
2009-01-01 06:00:00  0.113500  0.091250  0.016750
2009-01-01 09:00:00  0.135750  0.091500  0.016250
2009-01-01 12:00:00  0.140917  0.096167  0.017000

In [54]:
## selected by month
data[data.index.month == 2].head()

                      L06_347  LS06_347  LS06_348
Time
2009-02-01 00:00:00  0.204667  0.158250  0.022583
2009-02-01 03:00:00  0.200500  0.153667  0.021833
2009-02-01 06:00:00  0.198583  0.151750  0.021917
2009-02-01 09:00:00  0.210583  0.164833  0.022750
2009-02-01 12:00:00  0.200500  0.153833  0.024333

In [65]:
data.between_time('06:00:00','09:00:00').head()

                      L06_347  LS06_347  LS06_348
Time
2009-01-01 06:00:00  0.113500  0.091250  0.016750
2009-01-01 09:00:00  0.135750  0.091500  0.016250
2009-01-02 06:00:00  0.112917  0.091417  0.016333
2009-01-02 09:00:00  0.141917  0.097083  0.016417
2009-01-03 06:00:00  0.119417  0.080250  0.015417

In [69]:
## resample in 2d interve
data.resample('2D').mean().head()

             L06_347  LS06_347  LS06_348
Time
2009-01-01  0.124578  0.094031  0.016521
2009-01-03  0.126880  0.094125  0.016708
2009-01-05  0.112292  0.086208  0.016344
2009-01-07  0.106484  0.076891  0.014708
2009-01-09  0.099036  0.076141  0.013797

In [72]:
data.resample('M').max().head()

             L06_347  LS06_347  LS06_348
Time
2009-01-31  9.046667  9.353333  0.637500
2009-02-28  5.978333  6.283333  0.432167
2009-03-31  2.485000  2.708333  0.189667
2009-04-30  0.424833  0.437083  0.079917
2009-05-31  5.990833  6.295833  0.569083

## Some userful tips
### sort

In [74]:
import pandas as pd
data = pd.DataFrame({'group':['a','a','a','b','b','b','c','c','c'],
                    'data':[4,3,2,1,12,3,4,5,7]})
data

   data group
0     4     a
1     3     a
2     2     a
3     1     b
4    12     b
5     3     b
6     4     c
7     5     c
8     7     c

In [76]:
data.sort_values(by = ['data','group'], ascending= [False, True],inplace= True)
data

   data group
4    12     b
8     7     c
7     5     c
0     4     a
6     4     c
1     3     a
5     3     b
2     2     a
3     1     b

In [78]:
## unique 
data = pd.DataFrame({'k1':['one']*3+['two']*4,
                   'k2':[3,2,1,3,3,4,4]})
data

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

In [79]:
### the k1 and k2 both duplicate
data.drop_duplicates()

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
5  two   4

In [80]:
### the k2 both duplicate
data.drop_duplicates(subset= 'k2')

    k1  k2
0  one   3
1  one   2
2  one   1
5  two   4

### new colmuns

In [107]:
import numpy as np
df = pd.DataFrame({'data1':np.random.randn(5),
                  'data2':np.random.randn(5)})
df['ration'] = df['data1']/df['data2']
df.head()

      data1     data2     ration
0 -0.089092  0.351644  -0.253359
1  0.419451  0.032558  12.883294
2 -0.553797  0.525394  -1.054060
3 -0.915631 -0.550038   1.664669
4  0.771311  1.177692   0.654934

## remove a column

In [109]:
df.drop('ration', axis = 1)

      data1     data2
0 -0.089092  0.351644
1  0.419451  0.032558
2 -0.553797  0.525394
3 -0.915631 -0.550038
4  0.771311  1.177692

## cut

连续值--> 离散化

In [112]:
ages = [15,18,20,21,22,34,41,52,63,79]
pd.cut(ages,bins= 5)

[(14.936, 27.8], (14.936, 27.8], (14.936, 27.8], (14.936, 27.8], (14.936, 27.8], (27.8, 40.6], (40.6, 53.4], (40.6, 53.4], (53.4, 66.2], (66.2, 79.0]]
Categories (5, interval[float64]): [(14.936, 27.8] < (27.8, 40.6] < (40.6, 53.4] < (53.4, 66.2] < (66.2, 79.0]]

In [119]:
bins = [10,30,50,80]
ages_cut = pd.cut(ages,bins)
ages_cut

[(10, 30], (10, 30], (10, 30], (10, 30], (10, 30], (30, 50], (30, 50], (50, 80], (50, 80], (50, 80]]
Categories (3, interval[int64]): [(10, 30] < (30, 50] < (50, 80]]

In [117]:
## discrete --> features
ages_cut.codes

array([0, 0, 0, 0, 0, 1, 1, 2, 2, 2], dtype=int8)

In [122]:
feature = ['AAA','BBB','CCCC']
ages_cut_label = pd.cut(ages,bins, labels = feature)
ages_cut_label

[AAA, AAA, AAA, AAA, AAA, BBB, BBB, CCCC, CCCC, CCCC]
Categories (3, object): [AAA < BBB < CCCC]

In [123]:
pd.value_counts(ages_cut_label)

AAA     5
CCCC    3
BBB     2
dtype: int64

### Null
空值判断

In [125]:
df = pd.DataFrame([range(3),[0, np.nan,0],[0,0,np.nan],range(3)])
df

   0    1    2
0  0  1.0  2.0
1  0  NaN  0.0
2  0  0.0  NaN
3  0  1.0  2.0

In [130]:
df.isnull()

       0      1      2
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [134]:
df.isnull().any(axis = 1)

0    False
1     True
2     True
3    False
dtype: bool

In [135]:
df.fillna(5)

   0    1    2
0  0  1.0  2.0
1  0  5.0  0.0
2  0  0.0  5.0
3  0  1.0  2.0

## Apply
like apply in R

operate for each columns/rows

axis = 0 / axis = 'rows': 按照每行运行

axis = 1 / axis = 'colmuns': 按照每列运行

In [2]:
data = pd.DataFrame({'food':['A1','A2','B1','B2','B3','C1','C2'],'data':[1,2,3,4,5,6,7]})
data

   data food
0     1   A1
1     2   A2
2     3   B1
3     4   B2
4     5   B3
5     6   C1
6     7   C2

In [3]:
def food_map(series):
    if series['food'] == 'A1':
        return 'A'
    elif series['food'] == 'A2':
        return 'A'
    elif series['food'] == 'B1':
        return 'B'
    elif series['food'] == 'B2':
        return 'B'
    elif series['food'] == 'B3':
        return 'B'
    elif series['food'] == 'C1':
        return 'C'
    elif series['food'] == 'C2':
        return 'C'

data['food_map'] = data.apply(food_map,axis = 1)
data

   data food food_map
0     1   A1        A
1     2   A2        A
2     3   B1        B
3     4   B2        B
4     5   B3        B
5     6   C1        C
6     7   C2        C

In [4]:
food2Upper = {
    'A1':'A',
    'A2':'A',
    'B1':'B',
    'B2':'B',
    'B3':'B',
    'C1':'C',
    'C2':'C'
}
data['upper'] = data['food'].map(food2Upper)
data

   data food food_map upper
0     1   A1        A     A
1     2   A2        A     A
2     3   B1        B     B
3     4   B2        B     B
4     5   B3        B     B
5     6   C1        C     C
6     7   C2        C     C

In [6]:
titanic = pd.read_csv('titanic_train.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
## find null in each colmun
def not_null_count(columns):
    columns_null = pd.isnull(columns)
    null = columns[columns_null]
    return len(null)
columns_null_count = titanic.apply(not_null_count, axis = 0)
columns_null_count

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
## map class name to each row
def which_class(row):
    pclass = row['Pclass']
    if pd.isnull(pclass):
        return 'Unknow'
    elif pclass == 1:
        return 'First class'
    elif pclass == 2:
        return 'Second class'
    elif pclass == 3:
        return 'Third class'
classes = titanic.apply(which_class,axis = 1)
classes.head()

0    Third class
1    First class
2    Third class
3    First class
4    Third class
dtype: object

In [10]:
## find all under 18 in each row(passenser)
def is_minor(row):
    if row['Age'] < 18:
        return True
    else:
        return False
minors = titanic.apply(is_minor,axis = 1)
minors.head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

### String Operate

In [11]:
import pandas as pd
import numpy as np

In [12]:
s = pd.Series(['A','b','C','AdC','123',np.nan])
s

0      A
1      b
2      C
3    AdC
4    123
5    NaN
dtype: object

In [13]:
s.str.lower()

0      a
1      b
2      c
3    adc
4    123
5    NaN
dtype: object

In [14]:
s.str.upper()

0      A
1      B
2      C
3    ADC
4    123
5    NaN
dtype: object

In [15]:
s.str.len()

0    1.0
1    1.0
2    1.0
3    3.0
4    3.0
5    NaN
dtype: float64

In [16]:
index = pd.Index(['  tang','  yu   ','di'])
index.str.strip()

Index(['tang', 'yu', 'di'], dtype='object')

In [17]:
index.str.lstrip()

Index(['tang', 'yu   ', 'di'], dtype='object')

#### replace

In [23]:
df = pd.DataFrame(np.random.randn(3,2),columns = ['A a','B b'],index = range(3))
df

        A a       B b
0 -0.878319  0.647080
1  0.569129  1.165166
2 -0.157969  0.635482

In [25]:
## modified the columns name with replace
df.columns = df.columns.str.replace(' ','_')
df

        A_a       B_b
0 -0.878319  0.647080
1  0.569129  1.165166
2 -0.157969  0.635482

In [26]:
## split
s = pd.Series(['a_b_C','c_d_e','f_g_h'])
s

0    a_b_C
1    c_d_e
2    f_g_h
dtype: object

In [27]:
s.str.split('_')

0    [a, b, C]
1    [c, d, e]
2    [f, g, h]
dtype: object

In [28]:
## split and convert to dataframe
s.str.split('_', expand = True)

   0  1  2
0  a  b  C
1  c  d  e
2  f  g  h

In [35]:
## the columns number of dataframe
s.str.split('_', expand = True, n = 1)

   0    1
0  a  b_C
1  c  d_e
2  f  g_h

#### exist

In [37]:
s = pd.Series(['A','Aas','Afgew','Ager','Agre','Ager'])
s

0        A
1      Aas
2    Afgew
3     Ager
4     Agre
5     Ager
dtype: object

In [38]:
s.str.contains('Ag')

0    False
1    False
2    False
3     True
4     True
5     True
dtype: bool

#### dummies
关联分析： 取所有的并集，再判读是否存在

In [39]:
s = pd.Series(['a','a|b','a|c'])
s

0      a
1    a|b
2    a|c
dtype: object

In [40]:
s.str.get_dummies(sep = '|')

   a  b  c
0  1  0  0
1  1  1  0
2  1  0  1